renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/application_code/renesas_code/audio_task.c
/**********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO
 * THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2020 Renesas Electronics Corporation. All rights reserved.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * File Name    : audio_task.c
 * Description  : 
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 20.11.2020 1.00     First Release
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
/* for using C standard library */
#include <stdio.h>
#include <string.h>

/* for using FIT Module */
#include "platform.h"
#include "r_cmtw_rx_if.h"
#include "r_ssi_api_rx_config.h"
#include "r_ssi_api_rx_if.h"
#include "r_ssi_api_rx_pinset.h"
#include "r_byteq_if.h"

/* for using Amazon FreeRTOS */
#include "FreeRTOS.h"
#include "semphr.h"

/* for RX72N Envision Kit system common header */
#include "rx72n_envision_kit_system.h"

/**********************************************************************************************************************
 Macro definitions
 *********************************************************************************************************************/
#define MEMS_MIC            (1)                 /* Output signal from microphone */
#define SINE_WAVE           (0)                 /* Output signal sine wave data */
#define OUTPUT_SIGNAL_FROM  SINE_WAVE
//#define OUTPUT_SIGNAL_FROM  MEMS_MIC

/* PCM Buffer definition */
#define BUFSIZE             (1024)              /* PCM Buffer Size (1sample = stareo) */
#define BUFNUM              (3)                 /* number of PCM Buffer */
#define CHANNELS            (2)                 /* number of PCM data channel */
#define FILE_READ_SIZE              (480)
#define INITIAL_READ_SECTOR_NUM     (24)
#define PCM_WIDTH_BIT_24            (3)
#define I2S_PCM_WIDTH               (4)
#define PCM_SAMPLE_NUM              (4)
#define PCM_WRITE_BUF_SIZE  (I2S_PCM_WIDTH * CHANNELS * PCM_SAMPLE_NUM)
#define NUM_SAMPLE_PER_READ_SIZE     (READ_SIZE / (PCM_WIDTH *CHANNELS))
#define PCM_UNUSED_BUF_LOW_LIMIT_NUM (20)


/* index for PCM buffer information array */
#define CURRENT             (0)                 /* index 0 : current information */
#define NEXT                (1)                 /* index 1 : current information */
#define BUFINFONUM          (2)                 /* array size, must be 2 for reload mechanizm */

/* CMT Cycle(Hz) */
#define CMT_CYCLE_HZ        (12000)     /* Sampring Frequency(48kHz) / Number of PCM data samples to write/read(4) */
/* CMTW Cycle(us) */
#define CMTW_CYCLE_US       (83)        /* Value = ((1 / CMT_CYCLE_HZ) * 1000000) or lower. */

/* LED Blink Count */
#define LED_CYCLE_COUNT     (1200)      /* Cycle is 0.1s. Count is 0.1 / (1 / CMT_CYCLE_HZ). */

/**********************************************************************************************************************
 Local Typedef definitions
 *********************************************************************************************************************/
/* PCM buffer information to interfece between main routine & isr */
typedef struct ssi_buf_info
{
    int32_t * p_buf_start; /* PCM buffer addres to transfer PCM data */
    uint16_t pcm_samples;  /* Number of PCM data samples in buffer   */
} buf_info_t;

/* definitions to request PCM buffer information */
typedef enum {
    NO_REQUEST   = 0x00,   /* no request                             */
    DATA_REQUEST = 0x01,   /* next PCM buffer information request    */
}  buf_info_request_t;

/* definitions to stop PCM transfer operation */
typedef enum {
    FLAG_RUN  = 0x00,      /* no stop request                         */
    FLAG_STOP = 0x01,      /* PCM data transfer operation stop request */
}  stop_flag_t;

/* error_information */
typedef enum {
    NO_ERROR = 0x00,
    MALLOC_FAILED,
	BYTEQ_OPEN_ERROR,
	BYTEQ_GET_ERROR,
    CMT_CH_GET_ERROR,
    CMT_START_ERROR,
    SSI_OPEN_ERROR_CH0,
    SSI_OPEN_ERROR_CH1,
    SSI_START_ERROR_CH0,
    SSI_START_ERROR_CH1,
    SSI_WRITE_FAILED,
    SSI_READ_FAILED,
    PCM_BUFFER_ERROR,
    SSI_STOP_ERROR_CH0,
    SSI_STOP_ERROR_CH1,
    SSI_CLOSE_ERROR_CH0,
    SSI_CLOSE_ERROR_CH1,
    CMT_STOP_ERROR,
    CMT_CLOSE_ERROR
} audio_error_t;

/* PCM buffer */
struct pcm_buf
{
    int32_t *pcm_buffer;
};

