renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/application_code/renesas_code/audio_task.c
/* definitions to PCM buffer malloc status */
typedef enum {
    NOT_EXECUTE = 0x00,        /* Does not executed the malloc */
    EXECUTED_MALLOC = 0x01,    /* Executed the malloc */
}  malloc_flag_t;

/* SSI Register */
typedef R_BSP_VOLATILE_EVENACCESS struct st_ssie  ssi_regs_t;

/**********************************************************************************************************************
 Exported global functions
 *********************************************************************************************************************/
void audio_task( void * pvParameters );
void cmt_callback( void *arg );
void d2audio_play_start( void );
void d2audio_play_stop( void );
void d2audio_record_start( void );
void d2audio_record_stop( void );
int32_t d2audio_data_set(uint8_t *read_buff, uint16_t read_size);
int32_t d2audio_data_read(void);

/**********************************************************************************************************************
 Private (static) variables and functions
 *********************************************************************************************************************/
/* PCM buffer information variables to interface. */
static buf_info_t buf_info_tx[BUFINFONUM];      /* information for transmit operation */
#if OUTPUT_SIGNAL_FROM == MEMS_MIC
static buf_info_t buf_info_rx[BUFINFONUM];      /* information for receive operation  */
#endif

/* variables to request PCM buffer information */
#if OUTPUT_SIGNAL_FROM == MEMS_MIC
static volatile buf_info_request_t buf_info_request_rx;  /* request for receive operation */
#endif

/* PCM buffer */
struct pcm_buf g_pcmbuf_tx[BUFNUM];
#if OUTPUT_SIGNAL_FROM == MEMS_MIC
struct pcm_buf g_pcmbuf_rx[BUFNUM];
#endif

int32_t g_idx_buf_tx = 0;               /* index of pcm_buffer_tx; */
#if OUTPUT_SIGNAL_FROM == MEMS_MIC
int32_t g_idx_buf_rx = 0;               /* index of pcm_buffer_rx; */
#endif

malloc_flag_t g_pcmbuf_tx_malloc = NOT_EXECUTE;
#if OUTPUT_SIGNAL_FROM == MEMS_MIC
malloc_flag_t g_pcmbuf_rx_malloc = NOT_EXECUTE;
#endif

/* Return code */
static volatile ssi_ret_t g_ssi_ret = SSI_ERR_PARAM;
static volatile cmtw_err_t cmtw_ret = CMTW_ERR_BAD_CHAN;

uint32_t g_pcm_buf_size;
uint8_t *g_pcm_buf_ptr;
byteq_hdl_t g_byte_que;
uint8_t g_read_buff[FILE_READ_SIZE];
uint8_t g_ssi_write_data[PCM_WRITE_BUF_SIZE];
uint32_t g_ssi_write_count = 0;
uint32_t g_before_ssi_write_count = 0;
uint16_t g_ssi_write_call_count = 20;
uint16_t g_pcm_data_width = 0;
uint16_t g_pcm_read_size = 0;
uint32_t g_ssi_write_call_count_clone = 0;

static volatile audio_error_t g_error_code = NO_ERROR;

/* callback counter */
static volatile int32_t g_cmt_cb_cnt = 0;

#if OUTPUT_SIGNAL_FROM == SINE_WAVE
/* Test wave */
static const int32_t test_wave[BUFSIZE*CHANNELS] =
{
#include "r_test_wave.h"
};
#endif

/* stop flag */
static volatile stop_flag_t stop_flag_play;
static volatile stop_flag_t stop_flag_record;

/* request flag for GUI */
uint8_t g_d2audio_play_request = 0;
uint8_t g_d2audio_read_stop_request = 0;
uint8_t g_d2audio_record_request = 0;
uint16_t g_pcm_bit_per_sample_num = 0;
uint16_t g_pcm_buf_num = 0;
int32_t g_previous_sd_detect_status = -1;
uint32_t g_read_pcm_size = 0;


/**********************************************************************************************************************
 Exported global variables
 *********************************************************************************************************************/
static void ssi_start_for_speakers( void );
static void ssi_write( void );
#if OUTPUT_SIGNAL_FROM == MEMS_MIC
static void ssi_start_for_mems_mic( void );
static void ssi_read( void );
#endif
static void ssi_stop ( void );
static void set_buf_info( const buf_info_t * p_buf_info, const int32_t * p_buf, const uint16_t pcm_samples );
static void audio_trap( audio_error_t error_code );
static void led_blink( void );

extern void d2audio_list_add(char *pstring);
extern void d2audio_file_search(void);
extern int32_t d2audio_read_data(uint8_t *read_buff, uint16_t request_read_size, uint16_t *read_size);
extern int32_t get_sdc_sd_detection(void);
extern void d2audio_get_chunck_size(uint32_t *get_chunk_size);
extern void d2audio_get_bit_per_sample(uint16_t *bit_per_sample);

/**********************************************************************************************************************
 * Function Name: audio_task
 * Description  : 
 * Arguments    : void * pvParameters : 
 * Return Value : none
 *********************************************************************************************************************/
void audio_task( void * pvParameters )
{
    cmtw_channel_settings_t cmtw_config;
#if OUTPUT_SIGNAL_FROM == MEMS_MIC
    uint32_t volatile buf_size;
#endif
    uint32_t file_read_size;
    ssi_regs_t *p_ssi_reg;
    int32_t sd_detect_status;
    int32_t ret_code;
	uint16_t queue_no_used_size;

    /* PCM buffer size initialization. */
#if OUTPUT_SIGNAL_FROM == MEMS_MIC
    buf_size = (BUFSIZE*CHANNELS)*4;
    g_pcmbuf_rx_malloc = NOT_EXECUTE;
#endif
    g_pcmbuf_tx_malloc = NOT_EXECUTE;

    /* Initialize port for LED */
    PORT4.PDR.BYTE = 1;

    stop_flag_play = FLAG_STOP;
    stop_flag_record = FLAG_STOP;
    memset(&g_read_buff, sizeof(g_read_buff), 0x00);
    memset(&g_ssi_write_data, sizeof(g_ssi_write_data), 0x00);
#if 0
    g_pcm_buf_size = READ_SIZE * READ_SECTOR_NUM;
    g_pcm_buf_size = g_pcm_buf_size / 6;
    g_pcm_buf_size = g_pcm_buf_size * CHANNELS * I2S_PCM_WIDTH * QUIE_NUM;
#endif

    /*** PCM data transfer operation ***/
    while(1)
    {
    	sd_detect_status = get_sdc_sd_detection();
    	if ((sd_detect_status == 0 ) &&
    		(g_previous_sd_detect_status != sd_detect_status))
    	{
    		g_previous_sd_detect_status = sd_detect_status;
    	    d2audio_file_search();
    	}
        if (FLAG_STOP == stop_flag_play )
        {
            if (1 == g_d2audio_play_request)
            {
                 /* Initialize for SPEAKER */
                 ssi_start_for_speakers();

                 /* CMTW Start */
                 memset(&cmtw_config, 0, sizeof(cmtw_config));
                 cmtw_config.time_unit = CMTW_TIME_USEC;
                 cmtw_config.clock_divisor = CMTW_CLK_DIV_8;
                 cmtw_config.clear_source = CMTW_CLR_CMT;
                 cmtw_config.cm_timer.time = CMTW_CYCLE_US;
                 cmtw_config.cm_timer.actions = CMTW_ACTION_CALLBACK;
                 cmtw_ret = R_CMTW_Open(CMTW_CHANNEL_0, &cmtw_config, cmt_callback);
                 if (CMTW_SUCCESS != cmtw_ret)
                 {
                     audio_trap(CMT_CH_GET_ERROR);
                 }

                 cmtw_ret = R_CMTW_Control(CMTW_CHANNEL_0, CMTW_CMD_START);
                 if (CMTW_SUCCESS != cmtw_ret)
                 {
                     audio_trap(CMT_START_ERROR);
                 }

                 stop_flag_play = FLAG_RUN;
            }
        }

        if (FLAG_STOP == stop_flag_record )
        {
            if (1 == g_d2audio_record_request)
            {
#if OUTPUT_SIGNAL_FROM == MEMS_MIC
                 /* Initialize for MEMS MIC */
                 ssi_start_for_mems_mic();
#endif
                 stop_flag_record = FLAG_RUN;
            }
        }

        if (FLAG_RUN == stop_flag_play )
        {
        	if (g_d2audio_read_stop_request == 0)
        	{
        		g_ssi_write_call_count_clone = g_ssi_write_count;
        		if (g_before_ssi_write_count + g_ssi_write_call_count <= g_ssi_write_count)
        		{
        			R_BYTEQ_Unused(g_byte_que, &queue_no_used_size);
        			if (queue_no_used_size >= PCM_UNUSED_BUF_LOW_LIMIT_NUM * g_pcm_read_size)
        			{
                    	ret_code = d2audio_data_read();
                		if (ret_code != 0)
                		{
                    		g_d2audio_read_stop_request = 1;
                		}

