renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/application_code/renesas_code/audio_task.c
        			}
            		g_before_ssi_write_count = g_ssi_write_call_count_clone;
        		}
        	}
            if (0 == g_d2audio_play_request)
            {
                do
                {
                    cmtw_ret = R_CMTW_Control(CMTW_CHANNEL_0, CMTW_CMD_STOP);
                } while (CMTW_SUCCESS != cmtw_ret);

                cmtw_ret = R_CMTW_Close(CMTW_CHANNEL_0);
                if (CMTW_SUCCESS != cmtw_ret)
                {
                    audio_trap(CMT_CLOSE_ERROR);
                }

                ssi_stop();
                R_BYTEQ_Close(g_byte_que);
                stop_flag_play = FLAG_STOP;
                stop_flag_record = FLAG_STOP;
                g_d2audio_read_stop_request = 0;
                g_previous_sd_detect_status = -1;
                g_before_ssi_write_count = 0;
                vPortFree(g_pcm_buf_ptr);
            }
        }

        if (FLAG_RUN == stop_flag_record )
        {
#if OUTPUT_SIGNAL_FROM == MEMS_MIC
            /* Check Receive Data Full Flag. */
            p_ssi_reg = (ssi_regs_t *)&SSIE0;

            if(1 == p_ssi_reg->SSIFSR.BIT.RDF)
            {
                ssi_read();
            }

            /* SSI data receive information setting */
            if ( DATA_REQUEST == buf_info_request_rx )  /* checks PCM buffer information request */
            {
                /* the next receive PCM buffer information setting */
                set_buf_info( &buf_info_rx[NEXT], g_pcmbuf_rx[g_idx_buf_rx++].pcm_buffer, BUFSIZE );
                buf_info_request_rx = NO_REQUEST;
                g_idx_buf_rx %= BUFNUM;

                /* execute signal processing (e.g. attenuation) here, if needed */

                /* copy operation for PCM data loopback */
                memcpy( g_pcmbuf_tx[g_idx_buf_tx].pcm_buffer, g_pcmbuf_rx[g_idx_buf_rx].pcm_buffer, buf_size );
            }

            if (0 == g_d2audio_record_request)
            {
                do
                {
                    cmtw_ret = R_CMTW_Control(CMTW_CHANNEL_0, CMTW_CMD_STOP);
                } while (CMTW_SUCCESS != cmtw_ret);

                cmtw_ret = R_CMTW_Close(CMTW_CHANNEL_0);
                if (CMTW_SUCCESS != cmtw_ret)
                {
                    audio_trap(CMT_CLOSE_ERROR);
                }

                ssi_stop();

                stop_flag_play = FLAG_STOP;
                stop_flag_record = FLAG_STOP;
            }
#endif /* OUTPUT_SIGNAL_FROM == MEMS_MIC */
        }
    }

} /* End of function audio_task */

#if OUTPUT_SIGNAL_FROM == MEMS_MIC
/**********************************************************************************************************************
 * Function Name: ssi_start_for_mems_mic
 * Description  : Initialize SSI for the MEMS microphone.
 * Arguments    : none
 * Return Value : none
 *********************************************************************************************************************/
static void ssi_start_for_mems_mic( void )
{
    uint32_t malloc_size;
    uint8_t i;

    if (NOT_EXECUTE == g_pcmbuf_rx_malloc)
    {
        /* PCM buffer initialization. */
        malloc_size = BUFSIZE * CHANNELS * 4;

        for(i=0; i<BUFNUM; i++)
        {
            g_pcmbuf_rx[i].pcm_buffer = pvPortMalloc(malloc_size);
            if (g_pcmbuf_rx[i].pcm_buffer == NULL)
            {
                audio_trap(MALLOC_FAILED);
            }
            memset(g_pcmbuf_rx[i].pcm_buffer, 0, malloc_size);
        }
        g_pcmbuf_rx_malloc = EXECUTED_MALLOC;
    }

    /* MEMS microphone */
    g_ssi_ret = R_SSI_Open(SSI_CH0);
    if ( SSI_SUCCESS == g_ssi_ret )
    {
        /* first receive PCM buffer information setting */
        g_idx_buf_rx = 0;
        set_buf_info( &buf_info_rx[CURRENT], g_pcmbuf_rx[g_idx_buf_rx++].pcm_buffer, BUFSIZE );
        g_idx_buf_rx %= BUFNUM;

        /* request for the next PCM buffer information, just for the start operation */
        buf_info_request_tx = NO_REQUEST; /* the next PCM buffer information request */

        /* configures SSI0 pins SSI functions */
        R_SSI_PinSet_SSIE0();

        /* MEMS microphone input enable. */
        g_ssi_ret = R_SSI_Start(SSI_CH0);
        if ( SSI_SUCCESS != g_ssi_ret )
        {
            audio_trap(SSI_START_ERROR_CH0);
        }
    }
    else
    {
        audio_trap(SSI_OPEN_ERROR_CH0);
    }
} /* End of function ssi_start_for_mems_mic */
#endif /* OUTPUT_SIGNAL_FROM == MEMS_MIC */

/**********************************************************************************************************************
 * Function Name: ssi_start_for_speakers
 * Description  : Initialize SSI for the Powered speakers.
 * Arguments    : none
 * Return Value : none
 *********************************************************************************************************************/
static void ssi_start_for_speakers( void )
{
    uint32_t malloc_size;
    uint8_t i;

    if (NOT_EXECUTE == g_pcmbuf_tx_malloc)
    {
        /* PCM buffer initialization. */
        malloc_size = BUFSIZE * CHANNELS * 4;

        for(i=0; i<BUFNUM; i++)
        {
            g_pcmbuf_tx[i].pcm_buffer = pvPortMalloc(malloc_size);
            if (g_pcmbuf_tx[i].pcm_buffer == NULL)
            {
                audio_trap(MALLOC_FAILED);
            }
            memset(g_pcmbuf_tx[i].pcm_buffer, 0, malloc_size);
        }
        g_pcmbuf_tx_malloc = EXECUTED_MALLOC;

#if OUTPUT_SIGNAL_FROM == SINE_WAVE
        memcpy(g_pcmbuf_tx[g_idx_buf_tx].pcm_buffer, test_wave, malloc_size);
#endif
    }

    /* Powered speakers */
    g_ssi_ret = R_SSI_Open(SSI_CH1);
    if ( SSI_SUCCESS == g_ssi_ret )
    {
        /* PCM buffer information initial setting before start operation */
        /* first transmit PCM buffer information setting */
        g_idx_buf_tx = 0;
        set_buf_info( &buf_info_tx[CURRENT], g_pcmbuf_tx[g_idx_buf_tx++].pcm_buffer, BUFSIZE );
        g_idx_buf_tx %= BUFNUM;

        /* configures SSI1 pins SSI functions */
        R_SSI_PinSet_SSIE1();

        /* Powered speakers output enable */
        g_ssi_ret = R_SSI_Start(SSI_CH1);
        if ( SSI_SUCCESS != g_ssi_ret )
        {
            audio_trap(SSI_START_ERROR_CH1);
        }
    }
    else
    {
        audio_trap(SSI_OPEN_ERROR_CH1);
    }
} /* End of function ssi_start_for_speakers */

/**********************************************************************************************************************
 * Function Name: ssi_write
 * Description  : Write data to the TX FIFO when the TX FIFO is empty.
 * Arguments    : none
 * Return Value : none
 *********************************************************************************************************************/
static void ssi_write( void )
{
    int8_t ssi_ret;
    uint8_t write_buff_index;
    byteq_err_t err_code;

