renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/application_code/renesas_code/audio_task.c
    for(write_buff_index = 0; write_buff_index < PCM_WRITE_BUF_SIZE; write_buff_index++)
    {
        err_code = R_BYTEQ_Get(g_byte_que, &g_ssi_write_data[write_buff_index]);
        if (err_code == BYTEQ_ERR_QUEUE_EMPTY)
        {
        	if (g_d2audio_read_stop_request == 1)
        	{
        		g_d2audio_play_request = 0;
        	}
        	else
        	{
        		err_code = BYTEQ_SUCCESS;
        	}
        	break;
        }
    }
    if (err_code == BYTEQ_SUCCESS)
    {
        ssi_ret = R_SSI_Write(SSI_CH1, (const void *)&g_ssi_write_data[0], (uint8_t)I2S_PCM_WIDTH );
        if ( ssi_ret <= 0 )
        {
	        g_d2audio_play_request = 0;
        }
    }
    g_ssi_write_count++;
} /* End of function ssi_write */

#if OUTPUT_SIGNAL_FROM == MEMS_MIC
/**********************************************************************************************************************
 * Function Name: ssi_read
 * Description  : Read data from the RX FIFO when the RX FIFO is full.
 * Arguments    : none
 * Return Value : none
 *********************************************************************************************************************/
static void ssi_read( void )
{
    int8_t ssi_ret;
    uint16_t samples;   /* 1sample = stareo */

    /* gets the number to write from buf_info_rx[CURRENT]. */
    samples = buf_info_rx[CURRENT].pcm_samples;     /* This value remains when limiting is not needed */

    /* checks "samples" if larger than limit, limits the number. */
    if ( samples >= 4u )    /* case 24 bit PCM data */
    {
        samples = 4u;
    }

    /* write PCM data to RX FIFO */
    if ( samples > 0 )
    {
        ssi_ret = R_SSI_Read(SSI_CH0, (void *)buf_info_rx[CURRENT].p_buf_start, (uint8_t)samples );

        /* update PCM buffer information */
        if ( ssi_ret >= 0 )
        {
            buf_info_rx[CURRENT].p_buf_start += (ssi_ret * CHANNELS);
            buf_info_rx[CURRENT].pcm_samples -= (uint16_t)ssi_ret;
        }
        else 
        {
            audio_trap(SSI_READ_FAILED);
        }
    }

    /* check remaind current samples
        if no samples remaind, sets next buffer, and requests next PCM buffer information */
    if ( 0u == buf_info_rx[CURRENT].pcm_samples )    /* are all samples transferred ? */
    {
        if ( NO_REQUEST == buf_info_request_rx )     /* is PCM buffer information updated ? */
        {
            buf_info_rx[CURRENT] = buf_info_rx[NEXT];/* loads next buffer information */
            buf_info_request_rx = DATA_REQUEST;      /* requests next PCM buffer information */
        }
        else
        {
            audio_trap(PCM_BUFFER_ERROR);
        }
    }
} /* End of function ssi_read */
#endif /* OUTPUT_SIGNAL_FROM == MEMS_MIC */

/**********************************************************************************************************************
 * Function Name: ssi_stop
 * Description  : 
 * Arguments    : none
 * Return Value : none
 *********************************************************************************************************************/
static void ssi_stop(void)
{
#if OUTPUT_SIGNAL_FROM == MEMS_MIC
    /*** PCM data transfer stop operation ***/
    if ( SSI_SUCCESS != R_SSI_Stop( SSI_CH0 ) )
    {
        audio_trap(SSI_STOP_ERROR_CH0);
    }
#endif
    if ( SSI_SUCCESS != R_SSI_Stop( SSI_CH1 ) )
    {
        audio_trap(SSI_STOP_ERROR_CH1);
    }

    /* set ports output "0", before SSI0 closed. */
//    init_port_ssi0();

    /* SSI close operation */
#if OUTPUT_SIGNAL_FROM == MEMS_MIC
    if ( SSI_SUCCESS != R_SSI_Close( SSI_CH0 ) )
    {
        audio_trap(SSI_CLOSE_ERROR_CH0);
    }
#endif

    if ( SSI_SUCCESS != R_SSI_Close( SSI_CH1 ) )
    {
        audio_trap(SSI_CLOSE_ERROR_CH1);
    }
} /* End of function ssi_stop */

/**********************************************************************************************************************
 * Function Name: cmt_callback
 * Description  : Callback function for CMT.
 * Arguments    : void * arg : pointer to channel data.
 * Return Value : none
 *********************************************************************************************************************/
void cmt_callback( void *arg )
{
    ssi_regs_t *p_ssi_reg;

    led_blink();

    if (g_d2audio_play_request == 1)
    {
        /* Check Transmit Data Empty Flag. */
        p_ssi_reg = (ssi_regs_t *)&SSIE1;
        if(1 == p_ssi_reg->SSIFSR.BIT.TDE)
        {
            ssi_write();
        }
    }
} /* End of function cmt_callback */

/**********************************************************************************************************************
 * Function Name: set_buf_info
 * Description  : buffer information setting.
 * Arguments    : buf_info_t * p_buf_info : pointer to PCM buffer information
 *              : int16_t * p_buf         : pointer to PCM buffer
 *              : uint16_t pcm_samples    : number of PCM samples
 * Return Value : none
 *********************************************************************************************************************/
static void set_buf_info( const buf_info_t * p_buf_info, const int32_t * p_buf, const uint16_t pcm_samples )
{
    buf_info_t * p_info;

    p_info = (buf_info_t *)p_buf_info;
    p_info->p_buf_start = (int32_t *)p_buf;
    p_info->pcm_samples = pcm_samples;
} /* End of function set_buf_info() */

/**********************************************************************************************************************
 * Function Name: audio_trap
 * Description  : Trap function.
 * Arguments    : audio_error_t error_code : error code
 * Return Value : none
 *********************************************************************************************************************/
static void audio_trap( audio_error_t error_code )
{
    g_error_code = error_code;
    while(1)
    {
        R_BSP_NOP();
    }
} /* End of function cmt_callback */

/**********************************************************************************************************************
 * Function Name: led_blink
 * Description  : Blink the LED.
 * Arguments    : none
 * Return Value : none
 *********************************************************************************************************************/
static void led_blink( void )
{
    g_cmt_cb_cnt++;

