renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/application_code/renesas_code/audio_task.c
    if(g_cmt_cb_cnt > LED_CYCLE_COUNT)
    {
        if(PORT4.PIDR.BIT.B0 == 1)
        {
            PORT4.PODR.BIT.B0 = 0;
        }
        else
        {
            PORT4.PODR.BIT.B0 = 1;
        }
        g_cmt_cb_cnt = 0;
    }
} /* End of function led_blink */

/**********************************************************************************************************************
 * Function Name: d2audio_play_start
 * Description  : 
 * Arguments    : none
 * Return Value : none
 *********************************************************************************************************************/
void d2audio_play_start(void)
{
	uint16_t read_size = 0;
	int32_t ret_code;
	uint8_t buff_count;
    byteq_err_t err_code;
    uint8_t *test_buff_ptr;
    uint16_t malloc_size;

    if (g_d2audio_play_request == 0)
    {
        d2audio_get_bit_per_sample(&g_pcm_data_width);
        g_pcm_bit_per_sample_num = FILE_READ_SIZE / ((g_pcm_data_width / 8) * CHANNELS);
        g_pcm_read_size = (g_pcm_data_width / 8) * CHANNELS * g_pcm_bit_per_sample_num;
        g_pcm_buf_num = 65535 / (g_pcm_bit_per_sample_num * (g_pcm_data_width / 8) * CHANNELS);
        g_pcm_buf_size = g_pcm_read_size * g_pcm_buf_num;
        g_pcm_buf_ptr = (uint8_t *)pvPortMalloc(g_pcm_buf_size);
    	d2audio_get_chunck_size(&g_read_pcm_size);
        err_code = R_BYTEQ_Open(g_pcm_buf_ptr, g_pcm_buf_size, &g_byte_que);
    	if (err_code != BYTEQ_SUCCESS)
    	{
    		audio_trap(BYTEQ_OPEN_ERROR);
    	}
    	for (buff_count = 0; buff_count<INITIAL_READ_SECTOR_NUM; buff_count++)
    	{
        	ret_code = d2audio_read_data(&g_read_buff[0], (FILE_READ_SIZE), &read_size);
        	if (ret_code == 0)
        	{
            	ret_code = d2audio_data_set(&g_read_buff[0], read_size);
            	if (ret_code != 0)
            	{
            		break;
            	}
        	}
    	}
    	if ((read_size > 0) && (ret_code == 0))
    	{
            g_d2audio_play_request = 1;
    	}
    }
} /* End of function d2audio_play_start */


int32_t d2audio_data_read(void)
{
	uint16_t read_size = 0;
	uint16_t que_no_used_size;
	int32_t ret_code = 0;
	uint8_t buff_count;
    byteq_err_t err_code;
    uint16_t que_space;
	ret_code = d2audio_read_data(&g_read_buff[0], (FILE_READ_SIZE), &read_size);
	if ((ret_code == 0) || (read_size > 0))
	{
    	ret_code = d2audio_data_set(&g_read_buff[0], read_size);
	}
	return ret_code;

} /* End of function d2audio_play_start */

int32_t d2audio_data_set(uint8_t *read_buff, uint16_t read_size)
{
	int32_t ret_code = 0;
	uint16_t read_count;
	uint16_t queue_index = 0;
	byteq_err_t err_code;
	uint8_t set_data;
	uint8_t surplus;

	err_code = BYTEQ_SUCCESS;

	for (read_count = 0; read_count < read_size; read_count++ )
	{
        if ((g_pcm_data_width / 8) == PCM_WIDTH_BIT_24)
        {
    		surplus = queue_index % 4;
    		if (surplus == 0)
    		{
    			err_code = R_BYTEQ_Put(g_byte_que, 0x00);
    			if (err_code == BYTEQ_ERR_QUEUE_FULL)
    			{
    				ret_code = 1;
    				break;
    			}
    			queue_index++;
    		}
        }
		set_data = *(read_buff + read_count);
		err_code = R_BYTEQ_Put(g_byte_que, set_data);
		if (err_code == BYTEQ_ERR_QUEUE_FULL)
		{
			ret_code = 1;
			break;
		}
		queue_index++;
	}
	return ret_code;
}

/**********************************************************************************************************************
 * Function Name: d2audio_play_stop
 * Description  : 
 * Arguments    : none
 * Return Value : none
 *********************************************************************************************************************/
void d2audio_play_stop(void)
{
    if (g_d2audio_play_request == 1)
    {
        g_d2audio_play_request = 0;
    }
} /* End of function d2audio_play_stop */

/**********************************************************************************************************************
 * Function Name: d2audio_record_start
 * Description  : 
 * Arguments    : none
 * Return Value : none
 *********************************************************************************************************************/
void d2audio_record_start(void)
{
    if (g_d2audio_record_request == 0)
    {
        g_d2audio_record_request = 1;
    }
} /* End of function d2audio_record_start */

/**********************************************************************************************************************
 * Function Name: d2audio_record_stop
 * Description  : 
 * Arguments    : none
 * Return Value : none
 *********************************************************************************************************************/
void d2audio_record_stop(void)
{
    if (g_d2audio_record_request == 1)
    {
        g_d2audio_record_request = 0;
    }
} /* End of function d2audio_record_stop */

